{
  "abrasive_product": 0,
  "accessory_active": 1,
  "accessory_cable": 2,
  "accessory_car": 3,
  "accessory_cell": 4,
  "accessory_clothing": 5,
  "accessory_coat": 6,
  "accessory_coffee": 7,
  "accessory_computer": 8,
  "accessory_controller": 9,
  "accessory_cover": 10,
  "accessory_cradle": 11,
  "accessory_doll": 12,
  "accessory_drive": 13,
  "accessory_electronics": 14,
  "accessory_exterior": 15,
  "accessory_game": 16,
  "accessory_helmet": 17,
  "accessory_home": 18,
  "accessory_instrument": 19,
  "accessory_interior": 20,
  "accessory_jacket": 21,
  "accessory_jewelry": 22,
  "accessory_kitchen": 23,
  "accessory_lawn": 24,
  "accessory_light": 25,
  "accessory_men": 26,
  "accessory_microphone": 27,
  "accessory_motorcycle": 28,
  "accessory_mount": 29,
  "accessory_novelty": 30,
  "accessory_outdoors": 31,
  "accessory_patio": 32,
  "accessory_performance": 33,
  "accessory_phone": 34,
  "accessory_player": 35,
  "accessory_printer": 36,
  "accessory_rv": 37,
  "accessory_scanner": 38,
  "accessory_shirt": 39,
  "accessory_shoe": 40,
  "accessory_shoes": 41,
  "accessory_storage": 42,
  "accessory_supply": 43,
  "accessory_system": 44,
  "accessory_tablet": 45,
  "accessory_television": 46,
  "accessory_tool": 47,
  "accessory_use": 48,
  "accessory_video": 49,
  "accessory_watch": 50,
  "accessory_welding": 51,
  "accessory_woman": 52,
  "accessory_work": 53,
  "adapter_cable": 54,
  "adapter_car": 55,
  "adapter_network": 56,
  "adhesive_tape": 57,
  "aids_equipment": 58,
  "air_filter": 59,
  "air_lubricator": 60,
  "air_purifier": 61,
  "air_regulator": 62,
  "air_replacement": 63,
  "air_switch": 64,
  "air_treatment": 65,
  "alloy_metal": 66,
  "amplifier_electronics": 67,
  "art_supply": 68,
  "arts_craft": 69,
  "arts_fabric": 70,
  "arts_sewing": 71,
  "assembly_lighting": 72,
  "audio_cable": 73,
  "audio_component": 74,
  "audio_electronics": 75,
  "audio_home": 76,
  "audio_player": 77,
  "audio_radio": 78,
  "baby_loafer": 79,
  "baby_oxford": 80,
  "baby_product": 81,
  "baby_shoes": 82,
  "bag_laptop": 83,
  "bag_luggage": 84,
  "bag_vacuum": 85,
  "ball_bearing": 86,
  "band_watch": 87,
  "bar_glasses": 88,
  "bathroom_fixture": 89,
  "battery_charger": 90,
  "battery_power": 91,
  "bearing_power": 92,
  "bearing_product": 93,
  "bearing_roller": 94,
  "bed_frame": 95,
  "bed_skirt": 96,
  "bedroom_furniture": 97,
  "belt_hose": 98,
  "binder_binding": 99,
  "bit_drill": 100,
  "bit_tool": 101,
  "body_chemical": 102,
  "body_fluid": 103,
  "body_paint": 104,
  "body_parts": 105,
  "body_repair": 106,
  "body_restoration": 107,
  "body_scrubs": 108,
  "body_trim": 109,
  "bolt_screw": 110,
  "boot_shoe": 111,
  "box_lunch": 112,
  "boy_shoes": 113,
  "bracelet_charm": 114,
  "bracelet_jewelry": 115,
  "bracket_mount": 116,
  "bracket_stand": 117,
  "brake_parts": 118,
  "breakers_circuit": 119,
  "breakers_fuse": 120,
  "brush_tool": 121,
  "building_door": 122,
  "building_material": 123,
  "button_shirt": 124,
  "cabinet_furniture": 125,
  "cable_electronics": 126,
  "cable_wiring": 127,
  "camera_electronics": 128,
  "camera_photo": 129,
  "candy_chocolate": 130,
  "car_care": 131,
  "car_cell": 132,
  "car_electronics": 133,
  "car_mount": 134,
  "car_phone": 135,
  "car_slot": 136,
  "car_video": 137,
  "card_case": 138,
  "cards_computer": 139,
  "cards_currency": 140,
  "cards_subscription": 141,
  "care_health": 142,
  "care_personal": 143,
  "care_shoe": 144,
  "care_shoes": 145,
  "care_tool": 146,
  "cargo_liner": 147,
  "case_storage": 148,
  "ceiling_fan": 149,
  "ceiling_lighting": 150,
  "chair_furniture": 151,
  "charger_power": 152,
  "charm_jewelry": 153,
  "chest_protector": 154,
  "circuit_product": 155,
  "circuit_protection": 156,
  "cleaning_household": 157,
  "clothing": 158,
  "clothing_coat": 159,
  "clothing_dress": 160,
  "clothing_jacket": 161,
  "clothing_novelty": 162,
  "clothing_top": 163,
  "club_golf": 164,
  "coat_sport": 165,
  "coffee_espresso": 166,
  "coffee_machine": 167,
  "collar_pet": 168,
  "collar_shaft": 169,
  "component": 170,
  "component_computer": 171,
  "component_electronics": 172,
  "component_home": 173,
  "component_light": 174,
  "component_lighting": 175,
  "component_passive": 176,
  "component_resistor": 177,
  "component_stereo": 178,
  "component_transformer": 179,
  "computer_drive": 180,
  "computer_repeater": 181,
  "computer_scanner": 182,
  "computer_storage": 183,
  "connector_wiring": 184,
  "control_indicator": 185,
  "control_remote": 186,
  "control_vehicle": 187,
  "controller_game": 188,
  "controller_video": 189,
  "cooking_grill": 190,
  "country_cross": 191,
  "cover_gasket": 192,
  "cover_valve": 193,
  "craft_fabric": 194,
  "craft_game": 195,
  "craft_paper": 196,
  "craft_sewing": 197,
  "craft_supply": 198,
  "craft_toy": 199,
  "crib_furniture": 200,
  "crochet_knitting": 201,
  "curtain_shower": 202,
  "cutting_tool": 203,
  "data_storage": 204,
  "desk_holder": 205,
  "desk_organizer": 206,
  "development_programming": 207,
  "display_product": 208,
  "down_shirt": 209,
  "drink_nutrition": 210,
  "drum_set": 211,
  "dyeing_fabric": 212,
  "earring_jewelry": 213,
  "editing_video": 214,
  "education_science": 215,
  "effects_video": 216,
  "electronics": 217,
  "electronics_home": 218,
  "electronics_microphone": 219,
  "electronics_photo": 220,
  "electronics_player": 221,
  "electronics_printer": 222,
  "electronics_security": 223,
  "electronics_supply": 224,
  "electronics_surveillance": 225,
  "electronics_telephone": 226,
  "electronics_television": 227,
  "electronics_vehicle": 228,
  "electronics_video": 229,
  "end_mills": 230,
  "end_tool": 231,
  "engagement_rings": 232,
  "engine_parts": 233,
  "entertainment_furniture": 234,
  "envelope_mailer": 235,
  "envelope_office": 236,
  "envelope_product": 237,
  "envelope_shipping": 238,
  "envelope_supply": 239,
  "equipment_garage": 240,
  "equipment_instrument": 241,
  "equipment_jacks": 242,
  "equipment_medical": 243,
  "equipment_microphone": 244,
  "equipment_musical": 245,
  "equipment_product": 246,
  "equipment_tool": 247,
  "fabric_paint": 248,
  "fabric_sewing": 249,
  "faceplate_protector": 250,
  "faceplate_skin": 251,
  "fan_management": 252,
  "fan_product": 253,
  "fan_thermal": 254,
  "fastener": 255,
  "fastener_nut": 256,
  "fastener_pin": 257,
  "fastener_screw": 258,
  "fastener_stud": 259,
  "fiber_optic": 260,
  "field_shoes": 261,
  "field_track": 262,
  "filter_filtration": 263,
  "filter_lubricator": 264,
  "filter_oil": 265,
  "filter_pool": 266,
  "filter_regulator": 267,
  "filter_treatment": 268,
  "filter_water": 269,
  "filtration": 270,
  "filtration_lubricator": 271,
  "filtration_purification": 272,
  "filtration_regulator": 273,
  "filtration_treatment": 274,
  "fishing_fly": 275,
  "fishing_hunting": 276,
  "fitting_hydraulics": 277,
  "fitting_plumbing": 278,
  "fixture_kitchen": 279,
  "fixture_toilet": 280,
  "floor_jacks": 281,
  "floor_mat": 282,
  "fluid_oil": 283,
  "folding_furniture": 284,
  "food_gourmet": 285,
  "food_grocery": 286,
  "form_money": 287,
  "form_product": 288,
  "frame_furniture": 289,
  "fuel_parts": 290,
  "furniture": 291,
  "furniture_mattress": 292,
  "furniture_office": 293,
  "furniture_rack": 294,
  "furniture_recreation": 295,
  "furniture_room": 296,
  "furniture_stand": 297,
  "furniture_table": 298,
  "game": 299,
  "game_hardware": 300,
  "game_hobby": 301,
  "game_one": 302,
  "game_scooter": 303,
  "game_skate": 304,
  "game_toy": 305,
  "game_video": 306,
  "garage_jacks": 307,
  "garage_shop": 308,
  "garage_tool": 309,
  "garden_home": 310,
  "garden_lawn": 311,
  "garden_patio": 312,
  "gear_motorcycle": 313,
  "girl_shoes": 314,
  "girl_sock": 315,
  "golf_outdoors": 316,
  "golf_sport": 317,
  "gourmet_grocery": 318,
  "gourmet_staple": 319,
  "gps_navigation": 320,
  "grille_guard": 321,
  "grocery_pantry": 322,
  "guitar_hollow": 323,
  "guitar_instrument": 324,
  "hand_power": 325,
  "hand_tool": 326,
  "handling_material": 327,
  "handling_product": 328,
  "hardware_hooks": 329,
  "hardware_tool": 330,
  "harness_leash": 331,
  "health_personal": 332,
  "health_product": 333,
  "health_safety": 334,
  "heat_tubing": 335,
  "hobby_tool": 336,
  "hobby_toy": 337,
  "hoist_jacks": 338,
  "home_improvement": 339,
  "home_kitchen": 340,
  "home_safety": 341,
  "home_tool": 342,
  "home_vacuum": 343,
  "hydraulics_plumbing": 344,
  "hydraulics_pneumatics": 345,
  "hydraulics_tubing": 346,
  "improvement": 347,
  "improvement_tool": 348,
  "index_label": 349,
  "index_stamp": 350,
  "index_tab": 351,
  "indicator_switch": 352,
  "instrument_microphone": 353,
  "instrument_musical": 354,
  "interior_trim": 355,
  "internet_utility": 356,
  "jacket_lightweight": 357,
  "jacks_lift": 358,
  "jacks_shop": 359,
  "jacks_tool": 360,
  "jacks_vehicle": 361,
  "jewelry": 362,
  "jewelry_making": 363,
  "jewelry_novelty": 364,
  "jewelry_watch": 365,
  "jewelry_woman": 366,
  "kit_light": 367,
  "kit_lighting": 368,
  "kit_model": 369,
  "kitchen": 370,
  "lab_product": 371,
  "label_stamp": 372,
  "lamp_product": 373,
  "lawn_patio": 374,
  "level_sensor": 375,
  "light_lighting": 376,
  "liquid_sensor": 377,
  "lounge_sleep": 378,
  "lubricator_regulator": 379,
  "lubricator_treatment": 380,
  "material_plastic": 381,
  "material_product": 382,
  "material_raw": 383,
  "measure_test": 384,
  "medium": 385,
  "men_shoes": 386,
  "men_watch": 387,
  "meter_ph": 388,
  "microphone_musical": 389,
  "microphone_recording": 390,
  "microphone_studio": 391,
  "microphone_supply": 392,
  "microphone_wireless": 393,
  "mills_tool": 394,
  "money_wallet": 395,
  "motorcycle": 396,
  "motorcycle_parts": 397,
  "mount_stand": 398,
  "mower_parts": 399,
  "mower_power": 400,
  "mower_tool": 401,
  "music_video": 402,
  "necklace_pendant": 403,
  "novelty_special": 404,
  "office": 405,
  "office_product": 406,
  "office_supply": 407,
  "one_video": 408,
  "organization_storage": 409,
  "outdoors": 410,
  "outdoors_parts": 411,
  "outdoors_sport": 412,
  "parts": 413,
  "parts_performance": 414,
  "parts_repair": 415,
  "parts_replacement": 416,
  "parts_rv": 417,
  "parts_sport": 418,
  "parts_system": 419,
  "parts_vehicle": 420,
  "passive_resistor": 421,
  "passive_transformer": 422,
  "pet_supply": 423,
  "play_toy": 424,
  "player_portable": 425,
  "player_video": 426,
  "plumbing_pneumatics": 427,
  "plumbing_tubing": 428,
  "plush_purse": 429,
  "pneumatics_tubing": 430,
  "power": 431,
  "power_product": 432,
  "power_tool": 433,
  "power_transformer": 434,
  "power_transmission": 435,
  "printer_roller": 436,
  "printer_transfer": 437,
  "product_protection": 438,
  "product_safety": 439,
  "product_semiconductor": 440,
  "product_supply": 441,
  "product_transistor": 442,
  "product_transmission": 443,
  "programming_software": 444,
  "programming_web": 445,
  "projection_stud": 446,
  "protector_skin": 447,
  "purification_water": 448,
  "radio_two": 449,
  "radio_way": 450,
  "regulator_treatment": 451,
  "relay_switch": 452,
  "remote_vehicle": 453,
  "repair_replacement": 454,
  "repair_restoration": 455,
  "repair_tool": 456,
  "replacement": 457,
  "replacement_tool": 458,
  "rf_transistor": 459,
  "rings_wedding": 460,
  "rod_stud": 461,
  "roller_skate": 462,
  "safety_security": 463,
  "sanitation_supply": 464,
  "screw_tool": 465,
  "sealant_tape": 466,
  "security_surveillance": 467,
  "semiconductor_transistor": 468,
  "sensor": 469,
  "sewing_supply": 470,
  "sex_toy": 471,
  "shock_strut": 472,
  "shoe_shoes": 473,
  "shoes": 474,
  "shoes_sock": 475,
  "shoes_wallet": 476,
  "shoes_woman": 477,
  "shop_tool": 478,
  "shrink_tubing": 479,
  "skate_toy": 480,
  "software": 481,
  "software_utility": 482,
  "software_video": 483,
  "sport": 484,
  "stud_weld": 485,
  "supplement_vitamin": 486,
  "switch_toggle": 487,
  "test_tool": 488,
  "tire_tool": 489,
  "tire_wheel": 490,
  "tool_wrench": 491,
  "toy": 492,
  "two_way": 493,
  "uniform_work": 494,
  "watch_wrist": 495,
  "wiring": 496
}